<a href="https://colab.research.google.com/github/KomalMano/Story/blob/master/8_Concat_dataframes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd 

#now i am going to create my dataframe 1st . this is how u create a dataframe by giving JSON object as an input
india_weather = pd.DataFrame({
    "city" : ["mumbai","delhi","benglore"],
    "temp" : [32,45,30],
    "humidity" : [80,60,78]
})
india_weather

       city  temp  humidity
0    mumbai    32        80
1     delhi    45        60
2  benglore    30        78

In [2]:
#now creating 2nd dataframe
us_weather = pd.DataFrame({
    "city" : ["new york","chicago","orlando"],
    "temp" : [21,14,35],
    "humidity" : [68,65,75]
})
us_weather

       city  temp  humidity
0  new york    21        68
1   chicago    14        65
2   orlando    35        75

In [3]:
#now i want to join above these 2 dataframes
df = pd.concat([india_weather,us_weather])
df

       city  temp  humidity
0    mumbai    32        80
1     delhi    45        60
2  benglore    30        78
0  new york    21        68
1   chicago    14        65
2   orlando    35        75

In [4]:
#aove there is index problem bcz the index of dataframe is same as 1 dataframe.So resolve now.
df = pd.concat([india_weather,us_weather], ignore_index=True)
df
#now the indexing are in sequence
#u can search concat on google using pandas concat

       city  temp  humidity
0    mumbai    32        80
1     delhi    45        60
2  benglore    30        78
3  new york    21        68
4   chicago    14        65
5   orlando    35        75

In [5]:
#when pass the key it will create separate
df = pd.concat([india_weather,us_weather], keys=["india","us"])
df

             city  temp  humidity
india 0    mumbai    32        80
      1     delhi    45        60
      2  benglore    30        78
us    0  new york    21        68
      1   chicago    14        65
      2   orlando    35        75

In [6]:
#use this get back the orignal data
df.loc["india"]

       city  temp  humidity
0    mumbai    32        80
1     delhi    45        60
2  benglore    30        78

In [7]:
df.loc["us"]

       city  temp  humidity
0  new york    21        68
1   chicago    14        65
2   orlando    35        75

In [17]:
#u want to append 2nd data frame as in column instead just appending as rows 
temp_df = pd.DataFrame({
    "city" : ["mumbai","delhi","benglore"],
    "temp" : [32,45,30]
}, index=[0,1,2])
temp_df

       city  temp
0    mumbai    32
1     delhi    45
2  benglore    30

In [18]:
windspeed_df = pd.DataFrame({
    "city" : ["delhi","benglore"],
    "windspeed" : [7,12]
}, index=[1,2] )
windspeed_df

       city  windspeed
1     delhi          7
2  benglore         12

In [19]:
#i want to append windspeed appear as a column in front of temp as like orignal dataframe
df = pd.concat([temp_df, windspeed_df])
df

       city  temp  windspeed
0    mumbai  32.0        NaN
1     delhi  45.0        NaN
2  benglore  30.0        NaN
1     delhi   NaN        7.0
2  benglore   NaN       12.0

In [20]:
#axis 0 means 2nd dataframe append as rows, and when we change them zero to 1 axis it convert rows to column
df = pd.concat([temp_df, windspeed_df], axis=1)
df

       city  temp      city  windspeed
0    mumbai    32       NaN        NaN
1     delhi    45     delhi        7.0
2  benglore    30  benglore       12.0

In [21]:
#last thing we also join dataframe with series 
temp_df

       city  temp
0    mumbai    32
1     delhi    45
2  benglore    30

In [23]:
#now series here is . Now here i created series under below.
s = pd.Series(["Humid","Dry","Rain"], name="event")
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [25]:
#now i want to append this above series into temp . it can just added new series as a column
df = pd.concat([temp_df, s], axis=1)
df

       city  temp  event
0    mumbai    32  Humid
1     delhi    45    Dry
2  benglore    30   Rain